import sqlite3

conn = sqlite3.connect('Users')
cursor = conn.cursor()

cursor.execute('''CREATE TABLE IF NOT EXISTS children (
                    id_child INTEGER,
                    full_name TEXT,
                    class_name TEXT,
                    telephone TEXT,
                    status_walk BOOLEAN,
                    time_start TEXT,
                    time_finish TEXT,
                    out_med BOOLEAN,
                    out_state BOOLEAN
                 )''')
conn.commit()
# Функция для добавления ученика
def add_student(full_name, class_name):
    cursor.execute('''INSERT INTO children (id_child, full_name, class_name, telephone, status_walk, time_start, time_finish, out_med, out_state) 
                      VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)''',
                   (None, full_name, class_name, None, 0, None, None, 0, 0))
    conn.commit()

# Список учеников
students_10a = [
    "Алаева Алина",
    "Александрук Елизавета",
    "Барашкин Даниил",
    "Бовырина Дарья",
    "Виноградов Егор",
    "Виноградов Степан",
    "Грибкова Виктория",
    "Дикарев Владимир",
    "Дряхлова Екатерина",
    "Жотин Роман",
    "Жукова Дарья",
    "Задвернюк Владислав",
    "Колесов Александр",
    "Краснова Екатерина",
    "Лобан Евгения",
    "Мухин Артём",
    "Протопопов Владимир",
    "Снашнин Артем",
    "Соплякова Елена",
    "Сорокин Степан",
    "Сочнева Ксения",
    "Уткина Полина",
    "Худяков Артём",
    "Шлепов Илья",
    "Яковлев Ярослав"
]

# Добавление учеников из 10а
for student in students_10a:
    add_student(student, '10а')

# Список учеников для 10б (без отчеств)
students_10b = [
    "Баранцев Артём",
    "Ватин Егор",
    "Воронин Георгий",
    "Голубев Дмитрий",
    "Гречина Сабина",
    "Енаева Мария",
    "Железцова Полина",
    "Зеленцова Елизавета",
    "Золотов Сергей",
    "Котеева Варвара",
    "Крайнов Егор",
    "Крючкова Софья",
    "Маслова Варвара",
    "Мещерякова Мария",
    "Некрасова Екатерина",
    "Овчинников Дмитрий",
    "Орлов Сергей",
    "Павлов Егор",
    "Паршин Николай",
    "Ракитянский Артемий",
    "Рузанкина Елизавета",
    "Соломанин Даниил",
    "Сушинский Григорий",
    "Футина Анна",
    "Часовникова Вероника",
    "Черствова Анастасия",
    "Шубина Алина",
]

# Добавление учеников из 10б
for student in students_10b:
    add_student(student, '10б')

students_10v = [
    "Большаков Иван",
    "Бормотова Елена",
    "Васькова Анна",
    "Горий Арина",
    "Горячев Роман",
    "Гурлева Валерия",
    "Данилов Илья",
    "Жаврид Алёна",
    "Зыкин Александр",
    "Камалетдинова Элина",
    "Колесникова Марина",
    "Копченков Иван",
    "Костерина Екатерина",
    "Люмпе Виктория",
    "Маякова Екатерина",
    "Пеледова Марина",
    "Погодина Татьяна",
    "Попов Дмитрий",
    "Уваров Дмитрий",
    "Сизова Карина",
    "Шабанова Елизавета",
    "Шлякова Вероника"
]

# Добавление учеников из 10в
for student in students_10v:
    add_student(student, '10в')

students_10g = [
    "Белов Илья",
    "Власов Михаил",
    "Горохова Елена",
    "Гусарова Милана",
    "Дудин Даниил",
    "Журавлев Максим",
    "Иванова Анна",
    "Колосков Сергей",
    "Коткова Татьяна",
    "Кривоногов Артём",
    "Маркелов Егор",
    "Маркелов Леонид",
    "Матвеев Евгений",
    "Махлонов Роман",
    "Молоземов Андрей",
    "Молявина Анастасия",
    "Мухин Иван",
    "Наумов Николай",
    "Паткин Степан",
    "Перепелкин Алексей",
    "Полев Захар",
    "Смирнов Илья",
    "Усердов Антон",
    "Яничкин Роман"
]

# Добавление учеников из 10г
for student in students_10g:
    add_student(student, '10г')

students_10d = [
    "Агапов Александр",
    "Антонова Елизавета",
    "Бахтин Егор",
    "Белова Вероника",
    "Боброва Анна",
    "Востроконова Елизавета",
    "Вырышев Григорий",
    "Галина Арина",
    "Германскова Екатерина",
    "Ежкова Варвара",
    "Зинатуллин Михаил",
    "Кобяков Егор",
    "Кокарева Виктория",
    "Котова Анна",
    "Кузнецова Вероника",
    "Малютина Полина",
    "Маслова Диана",
    "Машенкова Екатерина",
    "Попович Ульяна",
    "Слепышева Кира",
    "Смирнова Арина",
    "Соколова Анна",
    "Строганова Виктория",
    "Струкова Дарья",
    "Телегин Макар",
    "Телегина Анастасия",
    "Худова Лилия",
]

# Добавление учеников из 10д
for student in students_10d:
    add_student(student, '10д')

# Список учеников для 10е (без отчеств)
students_10e = [
    "Алимханова Марина",
    "Вагина Дарья",
    "Горохов Дмитрий",
    "Грачева Екатерина",
    "Густов Григорий",
    "Данилова Дарья",
    "Дорничева Елизавета",
    "Ермакова Виктория",
    "Круглик Анна",
    "Лазарева Мария",
    "Махоткина Анастасия",
    "Музякова Ангелина",
    "Носова Анна",
    "Паров Константин",
    "Руденко Айлана",
    "Рябов Никита",
    "Сазанова Варвара",
    "Сливкина Арина",
    "Соколова Екатерина",
    "Степыкина Полина",
    "Федулова Юлия",
    "Хабарова Алина",
    "Халявина Маргарита",
    "Червякова Валерия"
]

# Добавление учеников из 10е
for student in students_10e:
    add_student(student, '10е')

# Список учеников для 10ж (без отчеств)
students_10zh = [
    "Абашева Кристина",
    "Агафонова Марина",
    "Березина Ксения",
    "Березина Полина",
    "Бормотина Софья",
    "Волкова Алёна",
    "Габриэльс Романовскис",
    "Дубинкина Виктория",
    "Комиссарова Алина",
    "Корнеева Елизавета",
    "Кривовичева Алина",
    "Куликова Ольга",
    "Моисеев Матвей",
    "Мысягина Алёна",
    "Плеханова Арина",
    "Ремизова Анна",
    "Рудняева Яна",
    "Рябова Елена",
    "Силаева Екатерина",
    "Сулимова Анастасия",
    "Тезиков Матвей",
    "Тушнова Виктория",
    "Умнова Алиса",
    "Хинчина Кристина",
    "Шевелев Илья",
    "Шмидт Ангелина",
    "Яковлева Екатерина",
]

# Добавление учеников из 10ж
for student in students_10zh:
    add_student(student, '10ж')

# Список учеников для 10з (без отчеств)
students_10z = [
    "Бачурин Илья",
    "Гончарова Ангелина",
    "Котова Ирина",
    "Макарова Елизавета",
    "Муравкина Дарья",
    "Павлова Екатерина",
    "Потапова Ольга",
    "Смирнова Лилия",
    "Трушков Александр",
    "Цепов Егор",
    "Чайчиц Денис",
    "Штанюк Мария",
    "Абрамова Вероника",
    "Белякова София",
    "Витальская Ангелина",
    "Калганова Мария",
    "Малкова Вера",
    "Шатрова Софья",
    "Щанкина Виктория",
    "Голубева Ева",
    "Дикарева Анастасия",
    "Мельник Марьяна",
    "Нужина Варвара",
    "Шарова Ирина"
]

# Добавление учеников из 10з
for student in students_10z:
    add_student(student, '10з')


students_11a = [
    "Алимов Илдар",
    "Веберт Екатерина",
    "Галактионова Елизавета",
    "Гальянов Семён",
    "Гущин Александр",
    "Дудич Михаил",
    "Емелина Юлия",
    "Ильина Екатерина",
    "Кирюхин Артëм",
    "Колесников Иван",
    "Колпакова Алиса",
    "Крупин Алексей",
    "Лебедева Яна",
    "Малинова Мария",
    "Малышев Артём",
    "Малышев Сергей",
    "Морозов Олег",
    "Назарова Диана",
    "Сальников Николай",
    "Смирнова Мария",
    "Сорокина Мария",
    "Стрелкин Дмитрий",
    "Трушков Иван",
    "Федосеев Артём",
    "Фомин Егор",
    "Штропкина Лидия",
    "Щербаков Кирилл"
]

# Добавление учеников из 11а
for student in students_11a:
    add_student(student, '11а')

students_11b = [
    "Аленькова Анна",
    "Андронов Матвей",
    "Атауллина Диляра",
    "Балацел Ефрем",
    "Голубева Вероника",
    "Горбатова Анастасия",
    "Горбунов Михаил",
    "Золотова Алина",
    "Калишина Мария",
    "Кирикова Мария",
    "Козинцев Кирилл",
    "Коновалова Яна",
    "Ламзина Диана",
    "Лунина Валерия",
    "Мещерова Камиля",
    "Минина Дарья",
    "Николаев Артем",
    "Носова Александра",
    "Руднева Кристина",
    "Самохвалова Ксения",
    "Сидорина Злата",
    "Стафеичева Александра",
    "Теленкова Дарья",
    "Тузова Олеся",
    "Цветкова Анастасия"
]

# Добавление учеников из 11б
for student in students_11b:
    add_student(student, '11б')

students_11v = [
    "Аляева Виктория",
    "Баракова Алиса",
    "Баташев Егор",
    "Буланкина Екатерина",
    "Бурлакова Арина",
    "Галкина Мария",
    "Гумерова Лейла",
    "Жаренова Дарья",
    "Иванова Людмила",
    "Курков Иван",
    "Молчанова Мария",
    "Мордвинов Владислав",
    "Мякишева Софья",
    "Наумов Сергей",
    "Никешина Анастасия",
    "Нуреева Хания",
    "Павленкова Полина",
    "Плюскова Ирина",
    "Редозубова Олеся",
    "Рыжикова Екатерина",
    "Рябова Ольга",
    "Салтыкова Валентина",
    "Спирина Юлия",
    "Цапина Арина",
    "Цветкова Татьяна"
]

# Добавление учеников из 11в
for student in students_11v:
    add_student(student, '11в')

students_11g = [
    "Астафьев Егор",
    "Береснева Софья",
    "Голубицких Никита",
    "Гордеева Елизавета",
    "Димов Александр",
    "Евстратова Алеся",
    "Елопов Федор",
    "Захаров Тимофей",
    "Зиновьев Максим",
    "Иванов Михаил",
    "Казанцева Анна",
    "Калашников Дмитрий",
    "Колмыков Максим",
    "Красненков Арсений",
    "Кузнецова Дарья",
    "Ламзин Фёдор",
    "Медведев Ярослав",
    "Павлычев Кирилл",
    "Петрухина Дарья",
    "Полушкин Дмитрий",
    "Пухов Андрей",
    "Строганов Илья",
    "Тузов Лев",
    "Хренов Денис",
    "Яковлев Леонид"
]

# Добавление учеников из 11г
for student in students_11g:
    add_student(student, '11г')

students_11d = [
    "Ахметжанова Карина",
    "Барцева Екатерина",
    "Буслаев Илья",
    "Вахромеев Ярослав",
    "Доронин Владимир",
    "Жиряков Матвей",
    "Ипатова Милана",
    "Козлова Анастасия",
    "Любезнова Мария",
    "Максимов Даниил",
    "Москунова Лия",
    "Назаров Егор",
    "Новиков Андрей",
    "Новожилова Маргарита",
    "Пугина Екатерина",
    "Пушкарева Полина",
    "Смирнова Дарья",
    "Соловьева Дарья",
    "Трусов Максим",
    "Усанов Кирилл",
    "Чернова Анастасия",
    "Фадеева Варвара",
    "Шевченко Марина"
]

# Добавление учеников из 11д
for student in students_11d:
    add_student(student, '11д')

students_11e = [
    "Адамова Алина",
    "Баранова Мария",
    "Бубнова Анастасия",
    "Вуккерт Вероника",
    "Галанов Владимир",
    "Германова Алина",
    "Гладышева Дарья",
    "Глазкова Виктория",
    "Гришакина Василиса",
    "Емельянова Алина",
    "Зайчикова Юлия",
    "Иванова Валерия",
    "Михель Михаил",
    "Моздухова Арина",
    "Новышева Александра",
    "Полянская Ульяна",
    "Пугачева Татьяна",
    "Ражева Анна",
    "Светова Юлия",
    "Талинина Дарья",
    "Чиркова Варвара"
]

# Добавление учеников из 11е
for student in students_11e:
    add_student(student, '11е')


students_11zh = [
    "Аргентова Дарья",
    "Галушко Мария",
    "Гардина Яна",
    "Герасимова Юлия",
    "Глазунова Татьяна",
    "Горелышев Артём",
    "Денисов Константин",
    "Жидкова Ксения",
    "Зельдин Дмитрий",
    "Кодочигова Алина",
    "Котыкова Арина",
    "Малышева Дарья",
    "Маснина Анастасия",
    "Медведева Анастасия",
    "Мусина Владислава",
    "Напылова Александра",
    "Окунева Елизавета",
    "Панова Лидия",
    "Сорокина Арина",
    "Томарова Светлана",
    "Худякова Ксения",
    "Чашин Владимир",
    "Шаронов Иван"
]

# Добавление учеников из 11ж
for student in students_11zh:
    add_student(student, '11ж')

# Закрытие соединения
conn.close()
